Tekla Open API Reference for Tekla Structures 2025
PointList.Contains Method
 Checks if the given point is in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Contains(
	Point value
)
Public Function Contains (
	value As Point
) As Boolean
Parameters
value
Type: Tekla.Structures.Geometry3d.Point
The point to be checked.
Return Value
Type: Boolean
True if the point is in the list, otherwise false.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace